user/tutorials/Nike/ISAT_paper/TML_2D/tt3.2_600_293/constant/chem
elements        
3
(
H
O
C
)
;


species        2(C12H26 N2);


reactions
{
}

Tlow            200;
Thigh           6000;

