user/tutorials/Nike/ISAT_paper/TML_2D/tt3.2_600_293/constant/thermo
N2
{
    specie
    {
        molWeight       28.0134;
    }
    equationOfState
    {
        Tc       	    126.1;
        Vc              0.0901;//m3/kmol
        Pc              3.39e+06;
        omega           0.039; //0.0377; //0.039; 
        Hig_phase       (3.53100528e+00 -1.23660988e-04 -5.02999433e-07 2.43530612e-09 -1.40881235e-12);
        Hig2_phase      (6.95808 2.03952 1681.60 0.506863 6535.68);
        mu              0.0;
        kappa           0.0;
        sigmvi          17.9;
    }
    thermodynamics
    {
        Tlow            100;
        Thigh           5000;
        Tcommon         1000;
        highCpCoeffs    ( 2.92664 0.00148798 -5.68476e-07 1.0097e-10 -6.75335e-15 -922.798 5.98053 ); //GRI30
        lowCpCoeffs     ( 3.29868 0.00140824 -3.96322e-06 5.64152e-09 -2.44485e-12 -1020.9 3.95037 ); //GRI30
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        N               2;
    }
}

C6H14
{
    specie
    {
        molWeight       86.1754;
    }
    equationOfState
    {
        Tc       	    507.6;
        Vc              0.368;//m3/kmol
        Pc              3.02e+06;
        omega           0.3003; //0.0377; //0.039; 
        Hig_phase       (3.53100528e+00 -1.23660988e-04 -5.02999433e-07 2.43530612e-09 -1.40881235e-12);
        Hig2_phase      (6.95808 2.03952 1681.60 0.506863 6535.68);
        mu              0.0;
        kappa           0.0;
        sigmvi          126.72;
    }
    thermodynamics
    {
        Tlow            100;
        Thigh           5000;
        Tcommon         1200;
        highCpCoeffs    (22.804647 2.09800119e-2 -3.53074129e-6 -5.46609072e-10  1.47893745e-13 -3.07498496e4 -95.8469533);
        lowCpCoeffs     (1.90038413 5.14640294e-2 7.91906421e-6 -3.47484905e-8 1.31381393e-11 -2.29428369e4 20.5073363); 
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        C              6;
        H              14;
    }
}

O2
{
    specie
    {
        molWeight       32.0;
    }
    equationOfState
    {
        Tc       	    155.0;
        Vc              0.080;//m3/kmol
        Pc              5.08e+06;
        omega           0.021; //0.039; 
        Hig_phase       (3.78246636e+00 -2.99673416e-03 9.84730200e-06 -9.68129608e-09 3.24372836e-12);
        Hig2_phase      (6.96302 2.40013 2522.05 2.21752 1154.15);
        mu              0.0;
        kappa           0.0;
        sigmvi          1.0;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 3.45852381 0.00104045351 -2.79664041e-07 3.11439672e-11 -8.55656058e-16 10222.9063 4.15264119 );
        lowCpCoeffs     ( 3.78535371 -0.0032192854 1.12323443e-05 -1.17254068e-08 4.17659585e-12 10292.2572 3.27320239 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        O               2;
    }
}

C12H26
{
    specie
    {
        molWeight       170.33start8;
    }
    equationOfState
    {
        Tc       	    658.0;
        Vc              0.754;//m3/kmol
        Pc              1.82e+06;
        omega           0.576385; //0.5742; 
        Hig_phase       (2.13264480e+01 -3.86394002e-02 3.99476113e-04 -5.06681097e-07 2.00697878e-10);
        Hig2_phase      (51.02700 143.8250 1664.760 109.4510 789.2970);
        mu              0.0;
        kappa           0.0;
        sigmvi          1.0;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           6000;
        Tcommon         1000;
        highCpCoeffs    ( 20.4565203 0.0348575357 -1.09226846e-05 1.67201776e-09 -9.8102485e-14 -32555.6365 -80.4405017 );
        lowCpCoeffs     ( 11.1532994 -0.00949419773 0.000195572075 -2.49753662e-07 9.84877715e-11 -26768.8904 -15.9096837 );
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        C               12;
        H               26;
    }
}

/*
C7H16
{
    specie
    {
        molWeight       100.201;
    }
    equationOfState
    {
        Tc       	    540.0;
        Vc              0.428;//m3/kmol
        Pc              2.74e+06;
        omega           0.349; //0.039; 
        Hig_phase       (1.11532484e+01 -9.49415433e-03 1.95571181e-04 -2.49752520e-07 9.84873213e-11);
        Hig2_phase      (30.4029 90.6941 1669.32 63.2028 764.611);
        mu              0.0;
        kappa           0.0;
    }
}
*/
CO2
{
    specie
    {
        molWeight       44.01;
    }

    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 3.85746 0.00441437 -2.21481e-06 5.2349e-10 -4.72084e-14 -48759.2 2.27164 );
        lowCpCoeffs     ( 2.35677 0.0089846 -7.12356e-06 2.45919e-09 -1.437e-13 -48372 9.90105 );
    }

    equationOfState
    {
        Tc       	    304.1;
        Vc              0.0919;//m3/kmol
        Pc              7.38e+06;
        omega           0.225; //0.039; 
        Hig_phase       (2.35677352e+00 8.98459677e-03 -7.12356269e-06 2.45919022e-09 -1.43699548e-13);
        Hig2_phase      (-7460.81 7.54056 7.51625 1442.70 5.38023 647.502);
        mu              0.0;
        kappa           0;
        sigmvi          1.0;
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        C               1;
        O               2;
    }
}

/*
CH4
{
    specie
    {
        molWeight       16.0;
    }
    equationOfState
    {
        Tc       	    191.0;
        Vc              0.09860;//m3/kmol
        Pc              4.6e+06;
        omega           0.01; //0.039; 
        Hig_phase       (5.14911468e+00 -1.36622009e-02 4.91453921e-05 -4.84246767e-08 1.66603441e-11);
        Hig2_phase      (8.003180 19.26330 2148.790 10.44230 1017.070);
        mu              0.0;
        kappa           0.0;
    }
}
*/


H2O
{
    specie
    {
        molWeight       18.0;
    }
    thermodynamics
    {
        Tlow            200;
        Thigh           3500;
        Tcommon         1000;
        highCpCoeffs    ( 3.03399 0.00217692 -1.64073e-07 -9.7042e-11 1.68201e-14 -30004.3 4.96677 );
        lowCpCoeffs     ( 4.19864 -0.00203643 6.5204e-06 -5.48797e-09 1.77198e-12 -30293.7 -0.849032 );
    }
    equationOfState
    {
        Tc       	    647.096;
        Vc              0.0559;//0.003155;//m3/kmol
        Pc              22.06e+06;
        omega           0.344; //0.039; 
        Hig_phase       (7.25575005e+01 -6.62445402e-01 2.56198746e-03 -4.36591923e-06 2.78178981e-09);
        Hig2_phase      (-13773.1 7.97183 6.27078 2572.63 2.0501 1156.72);
        mu              1.8;
        kappa           0.075908;
        sigmvi          1.0;
    }
    transport
    {
        As              1.67212e-06;
        Ts              170.672;
    }
    elements
    {
        O               1;
        H               2;
    }
}
/*
H2
{
    specie
    {
        molWeight       2.0;
    }
    equationOfState
    {
        Tc       	    33.18;
        Vc              0.0649;//m3/kmol
        Pc              1.32e+06;
        omega           -0.22; //0.039; 
        kappa           0.0;
        mu              0.0;
    }
}

H2S
{
    specie
    {
        molWeight       34.081;
    }
    equationOfState
    {
        Tc       	    373.3;
        Vc              0.09804;//m3/kmol
        Pc              8.97e+06;
        omega           0.081; //0.039; 
        kappa           0.9;
    }
}
*/